In [1]:
import pandas as pd
df_iris = pd.read_csv('../data/iris.csv')

In [2]:
df_iris

     sepal length  sepal width  petal length  petal width          target
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [3]:
df_iris.groupby(['target']).mean()

                 sepal length  sepal width  petal length  petal width
target
Iris-setosa             5.006        3.418         1.464        0.244
Iris-versicolor         5.936        2.770         4.260        1.326
Iris-virginica          6.588        2.974         5.552        2.026

In [4]:
df_iris.target.unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [5]:
df_iris['target'].unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [6]:
df_iris.groupby('target').mean().reset_index()

            target  sepal length  sepal width  petal length  petal width
0      Iris-setosa         5.006        3.418         1.464        0.244
1  Iris-versicolor         5.936        2.770         4.260        1.326
2   Iris-virginica         6.588        2.974         5.552        2.026

In [7]:
df_iris.groupby('target').mean()[['sepal width']]

                 sepal width
target
Iris-setosa            3.418
Iris-versicolor        2.770
Iris-virginica         2.974

In [8]:
df_iris.groupby('target').mean()[['sepal width', 'petal width']]

                 sepal width  petal width
target
Iris-setosa            3.418        0.244
Iris-versicolor        2.770        1.326
Iris-virginica         2.974        2.026

In [9]:
df_t = pd.read_csv('../data/titanic.csv')

In [10]:
df_t['survived'].value_counts()

0    549
1    342
Name: survived, dtype: int64

In [11]:
class_count = df_t['class'].value_counts()
class_count

Third     491
First     216
Second    184
Name: class, dtype: int64

In [12]:
pd.DataFrame(class_count)

        class
Third     491
First     216
Second    184

In [13]:
pd.DataFrame(df_t[['class', 'survived']].value_counts())

                   0
class  survived
Third  0         372
First  1         136
Third  1         119
Second 0          97
       1          87
First  0          80

In [14]:
pd.crosstab(df_t['class'], df_t['survived'], dropna = True)

survived    0    1
class
First      80  136
Second     97   87
Third     372  119

In [15]:
pd.crosstab(df_t['sex'], df_t['survived'])

survived    0    1
sex
female     81  233
male      468  109

In [16]:
pd.crosstab(df_t['sex'], df_t['survived'], normalize = True)

survived         0         1
sex
female    0.090909  0.261504
male      0.525253  0.122334

In [17]:
pd.crosstab(df_t['sex'], df_t['survived'], normalize = 'index')

survived         0         1
sex
female    0.257962  0.742038
male      0.811092  0.188908

In [18]:
pd.crosstab(df_t['sex'], df_t['survived'], normalize = 'columns')

survived         0         1
sex
female    0.147541  0.681287
male      0.852459  0.318713